Revit 2024 API
FilteredWorksetIdIterator Class
 An iterator to a set of workset ids filtered by the settings of a FilteredWorksetCollector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class FilteredWorksetIdIterator : IEnumerator<WorksetId>
Visual Basic
Public Class FilteredWorksetIdIterator _
	Implements IEnumerator(Of WorksetId)
Visual C++
public ref class FilteredWorksetIdIterator : IEnumerator<WorksetId^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredWorksetIdIterator
See Also
FilteredWorksetIdIterator Members
Autodesk.Revit.DB Namespace